{"review_id": "32XUlqIB4r_l-GlRUHHt-Q", "user_id": "My0I2VyffL128w8QxuAnRQ", "business_id": "jAO8qYbiYZNbmhK8Knr9Mg", "stars": 1, "date": "2013-04-08", "text": "I work in one of the buildings next door to where Rev is located and have been there a handful of times for the build your own salad when I did not bring my own lunch to work. When this place first opened the salads were delicious! Today I paid $6.11 for a salad and it was NOT impressive. I got maybe 1 oz of chicken which did not even appear to be white chicken breast. I got a little sprinkle of cheese and smattering of crouton crumbs on top. The balsamic dressing was fine, but that's about it. Very disappointing lunch today...", "useful": 1, "funny": 0, "cool": 0}
{"review_id": "_r1sDBVvpR34K7CLZwyDxQ", "user_id": "yl0SbBwERrfg0rY1f1Hdqw", "business_id": "jAO8qYbiYZNbmhK8Knr9Mg", "stars": 4, "date": "2014-08-26", "text": "The build your own breakfast burrito is a team favorite! The BYO salad and green chili chicken soup are pretty awesome if you're looking to keep it light for lunch. Some menu items are a bit over priced for what you get but overall, it's a convenient meal when there's a lot of work to be done!", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "QDfNq1jU9tJfrkjX2VvhFg", "user_id": "OfywnLkuXJ40RYhQaUToqQ", "business_id": "jAO8qYbiYZNbmhK8Knr9Mg", "stars": 5, "date": "2016-07-28", "text": "I work in the office building directly across the parking lot from Rev Bistro. I frequent Rev Bistro 2-3 times a week for breakfast. I always get the breakfast burrito and a soda. Gaston, the chef who makes my burrito, knows what I want when I walk in and starts making it immediately. Anna, the cashier, knows what I want also. Both of them, along with all the crew, are always friendly and I really enjoy taking my break to walk over there and get a really good burrito for breakfast. I have also had lunches there and all I can say is that I have NEVER had anything bad from Rev Bistro.", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "Esr4mI76QEzpqfGEzWTl-g", "user_id": "oWd7wL340Z9JiGf5Wu_bSQ", "business_id": "jAO8qYbiYZNbmhK8Knr9Mg", "stars": 3, "date": "2013-03-02", "text": "Apparently, this place in the University of Phoenix building is brand new or just reopened, so going to break it in with a Yelp review.  \n\nLooks clean, with a somewhat smallish selection of cafeteria-type foods.  Friendly service.  I opted for the flatbread pizza.  They top the pizza, and put it in this conveyor-style oven (similar to some toasters I've seen at college cafeterias hotel continental breakfast rooms.)  Quick and fast preparation, very cheap price, mediocre, salty taste.  Drinks are fairly pricy for the amount of soda you get.  Refills are worth almost as much as the full price drink.\n\nNot bad.  Good if you work in the building and you forgot lunch at home.  You would do better getting a drink at QT or Circle K on your way in the morning.  They close early on Fridays.", "useful": 5, "funny": 1, "cool": 2}
{"review_id": "B9YmDnq_dRnIpvBuXgEf9g", "user_id": "zbahX7xiLbjWWM4_L43lhg", "business_id": "jAO8qYbiYZNbmhK8Knr9Mg", "stars": 3, "date": "2017-07-25", "text": "This place is inside the University of Phoenix building so it's very convenient if you're here for a class. Their prices are super reasonable and they make food pretty quickly. Quality isn't stellar. We got pizza which you can customize with any toppings you want. Sauce tasted like Ragu and pizza was just okay. Convenience and price are the redeeming qualities here.", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "bs28oJ2XE7R2V4tLaRfxow", "user_id": "8ikHgBJlaw6ZLsCR6Mz8oQ", "business_id": "jAO8qYbiYZNbmhK8Knr9Mg", "stars": 5, "date": "2015-04-20", "text": "This place is awesome. Super good food for good price. They have nice clean vibe inside. Their gyro are setup up subway style make them your own way really good", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "jV17F9X7BsnvdxD5peByCw", "user_id": "6e0Ixt00zD2J8ytITeYhTw", "business_id": "jAO8qYbiYZNbmhK8Knr9Mg", "stars": 4, "date": "2014-09-26", "text": "I like the Bistro for what it is. It is a much better workplace cafe than others that I have experienced.  Bfast burritos are a solid choice. They have Thursday Chef's Table specials that are usually very good. Prices are fair and Gaston, Cindy, and Yadira give great customer service. \n\nThey should offer bfast pizzas every day, though!", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "nZ1h57VO13qUBm9wcYZGlw", "user_id": "ykY7aVvXlNgKpnbNjhUciA", "business_id": "GAPwjahm6fywOttzPCJLNw", "stars": 4, "date": "2012-02-20", "text": "Their sandwiches really pack on the meat, use a very fresh and soft bread, and are quite tasty.  They don't sell a footlong with 3 strips of deli meat.  Their sandwich is about 8\" with a good half pound of meat on it, maybe more.  I've been here a few times and their sandwiches have always been good.\n\nThe staff is also quite friendly.  The menu items include tax which is refreshing.  The only negative I have is that they don't offer a lower calorie side with the sandwich.  It is mararoni salad (mayo) or potato salad (mayo) or regular chips.  I wish they had some baked chips or a pasta salad with a simple oil & vinegar thing to be a little lighter.  \n\nWith that being said, it doesn't stop me from going back.  It is certainly better and cheaper than Sacks down the street and they fit more meat than Dilly's puts on their sandwich which has about 4 times the amount of bread.", "useful": 1, "funny": 0, "cool": 0}
{"review_id": "nb2PrdR6VsIURylyGDOv6g", "user_id": "2AZaPPRAWhDDO7k-jlpfwg", "business_id": "GAPwjahm6fywOttzPCJLNw", "stars": 4, "date": "2011-06-17", "text": "As literally the closest sandwich shop possible to where I live (I'm in the same complex), the perky Arizona Sandwich Company surprised me with dirt cheap, huge, fresh tasting, damn good sandwiches, made right.\n\nI get the Italian Bomber most times, which is loaded down with salami, ham, and pepperoni, along with lettuce, dressing, mayo, and the works. It's delicious, the bread is fantastic, and it's HUGE. The $5 \"shorty\" is more than enough to fill me up.\n\nThey're fast, friendly, and really tasty. I hate Jimmy Johns and I'm not at all fond of Subway, so I'm glad that there's a local sandwich shop that I can actually enjoy. Even better that I live one building over.", "useful": 0, "funny": 0, "cool": 1}
{"review_id": "cWnLS9SE0ntygCg0NBlbZA", "user_id": "Hp8gMR-ldyRjI_XpSjk0oQ", "business_id": "GAPwjahm6fywOttzPCJLNw", "stars": 4, "date": "2011-09-21", "text": "Great spot for a quick bite during a busy work day.  A bit difficult to find since it's in a tiny space on the bottom floor of an apartment complex, but a gem among Tempe sandwich shops.  The shop may be small but the sandwiches are HUGE!  I managed to get 2 meals from my \"shorty.\"   I went for the classic turkey with avocado and my lunch date chose the meatball sub special.   The bread is super fresh as are all the other ingredients.  The sides of potato salad and macaroni salad were the cheap deli brand, but that was fine by me.  Not to mention the staff is super friendly and incredibly quick to whip up your sandies'.       \n\nOnly two tables inside, so limited seating if it gets busy.  But a few tables outside if the weather is nice.", "useful": 1, "funny": 1, "cool": 1}
{"review_id": "19Ex1WPHdFmbhNx27BXA6w", "user_id": "QtIYPhvYJ3Qr7Io0rbh_5Q", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 2, "date": "2014-10-12", "text": "Just like every eatery, it is hit or miss with the service.  However this time, what's notable is the shrinkage of the menu and the quality of service.", "useful": 1, "funny": 0, "cool": 0}
{"review_id": "iltjnW146ys78L56Zm7mNw", "user_id": "A18dx8k4kVlJqUfsNmtxdA", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 1, "date": "2017-02-26", "text": "This was one of the absolute worst restaurant experiences I have ever had. I have patronized this chain for years and have never been this dissatisfied. My party was a reservation of 20 on a Saturday night. We were the only patrons on the restaurant and our food and drinks came out late and cold. The rice and beans were undercooked. The pasta was soggy. No one ever came back to check on us after the food was served.  It was a horrible experience", "useful": 1, "funny": 0, "cool": 0}
{"review_id": "OhQFlFzkf__wUN-3Dp1CJg", "user_id": "9kI17UdQgIQrcJN2qVP-JA", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 5, "date": "2010-03-17", "text": "I met a buddy here for dinner last night. Here is the lowdown:\n\nLocation: 5/5\nFood: 5/5\nService: 5/5\n\nDon't miss the cornbread, it's fantastic. We started out by splitting a bowl of chips and salsa. The salsa is fresh and very good. The chips were crunchy and not too salty. I had the green chili enchilada with black beans. Not normally a big black bean fan I was surprised how good these can taste when they are very fresh and well prepared. The rice was nice and fluffy and delicious. The waiter was cheerful and helpful with suggestions. The service was very prompt without hovering over us - not an easy balance to strike. \n\nA nice bonus is that they will valet your car for free. Just get your ticket validated by your server. The location is right off Mill Ave. so you are right in the heart of the action. The prices are very reasonable as well. Most of the entrees are $10-15. This place is great, give it a try.", "useful": 1, "funny": 0, "cool": 1}
{"review_id": "2YOj5SDA56kJmi2aV07sCA", "user_id": "pL4NhW3rTokFr-CQh3Lzgg", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 5, "date": "2014-03-11", "text": "I paid my first visit to Z-Tejas during a nice bike ride in Tempe because a co-worker of mine claimed they had a great happy hour. I have passed by this restaurant numerous times and didn't think anything special would come from a visit. I had the notion that this was another typical Mexican chain that was most likely overpriced and overrated. I can only speak for their happy hour, but it was probably one of the best happy hours around town! Everything was so cheap and great quality! I swear by their Chambord Margaritas...They are only $5 and although they seem smaller than expected, they pack a killer punch and tastes great! I was not expecting to feel that kind of buzz from one margarita! They definitely pour heavy with the alcohol!! We were planning on hitting the Chuck box for dinner afterwards so we decided to try an appetizer off of the happy hour menu just to give it a try and munch on a snack until we finished our drinks. That did not happen. We were sooooo full from the pork nachos appetizer that we could not even think about eating anything else. When the waitress brought them out, we were in shock and I guess it happens all the time because she immediately said, \" I know, they're huge and the biggest thing you can get for $5 anywhere.\" (LOOK AT MY PICTURE OF IT) Not only was it humongous, it was incredibly delicious!!! They are extremely generous with all of the toppings (and boy, do they have a lot of toppings). We asked for hot sauce and she brought out sriracha. At first we were like, sriracha? That weird, but she walked away and I love sriracha so I was like I'll give it a try, why not? WOW it surprisingly went perfect with the pork and cheese etc. I can't wait to come back for happy hour again because everything on the menu looked amazing!! Our server was so kind and funny. She was very helpful and helped us choose the perfect meal for the day! I think her name was Christina. I definitely recommend trying their happy hour!! I posted a picture of the HH menu and their hours are in there on the side. Happy Hour is 3-7 Mon-Fri and 2-6 on weekends. Do ITTTTTT!", "useful": 9, "funny": 4, "cool": 8}
{"review_id": "Pwox-nVbYioJ-K71il13vg", "user_id": "QGgWWhEi5R4SLAKN-xwtNQ", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 5, "date": "2015-01-16", "text": "Always great food! Love this place. Especially the appetizers.", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "bDb9mhIHa_0VJo24P2qLfg", "user_id": "OW0PZxoGFGSOthAmN_cSUg", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 4, "date": "2016-04-22", "text": "Service and food were both great. I ordered the small enchilada seafood lunch plate that comes with your choice of soup or salad. It was the perfect size, tons of flavor! A small handful of rice and black beans. I ordered the chicken tortilla soup and that was great as well. \n\nDon't order ice water however, it taste like dirt.", "useful": 1, "funny": 0, "cool": 1}
{"review_id": "BWVkJmvz6d4nPZxUhw_jSA", "user_id": "DJ8G-IzmeX_euX6Vp02DQg", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 3, "date": "2015-11-22", "text": "Had the Diablo pasta with shrimp and it was pretty tasty! For a Saturday night with an ASU football game night, serving was quite fast and the food I've had, I do recommend the place but yet want to keep it a secret as well.", "useful": 2, "funny": 2, "cool": 3}
{"review_id": "HJKpsEDGGtLQQj4vSEEVPg", "user_id": "oz5g-VdOay7s2yeTOOcq5Q", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 5, "date": "2016-06-17", "text": "Way to go Sean (aka PM Bar 1)! \n\nSat at the bar before our show at the Gammage. Free appetizer, great service (serious, appreciate it), good drinks and tasty food. Recommended for sure. \n\nChambord margarita, barbacoa enchiladas.", "useful": 1, "funny": 0, "cool": 1}
{"review_id": "FLQhivyFNfhSyJHLRnNngA", "user_id": "g4qdXv9tO5f-XxD2KVlKpA", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 4, "date": "2009-03-18", "text": "right near the heart of the university, it's basically a chevy's plus plus.  i will give them an extra star for the service.  my work colleague said that when i valeted my car they would just \"run out to meet me and park it for me\"... i didn't know he meant LITERALLY.  they ran like they were in a race, despite the lack of traffic behind me.  go Team Z! \n\nthe waitresses was likewise also very service oriented.  the outside seating was perfect weather which normally i suspect it isn't because of the cold in the winter and heat in the summer, but i hit it right on the head as far as good weather.  \n\nthe steak salad was pretty decent.  obviously, we're not looking for gourmet here.  we're looking for a strong showing in the \"solid, reliable, good ingredients\" and i think it makes the cut there.   the chips were good as well as the really nice corn bread they service complimentary.  my friend's enchilada's look great too.  so it beats chevy's from my perspective.  as far as reliable food with good service near the university, this looks like a very good choice.", "useful": 4, "funny": 3, "cool": 3}
{"review_id": "NjI0Ptzp-2VwJNcgGx14nA", "user_id": "JwipborR9YZkZLKrEPycmw", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 5, "date": "2016-04-25", "text": "Went here with a party of 12 on a Thursday night. Everyone was happy with meals and drinks. I had a chicken pasta dish with sun dried tomatoes and capers and it was excellent. I definitely recommend it for people visiting asu.", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "mxg-rNr1c__dNRF6nJjv6A", "user_id": "QGX5wOzqUxnfd8sePiNQWA", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 4, "date": "2011-08-24", "text": "I don't think I would really classify Z tejas as a four star restaurant, but I love the place for my wednesday afternoon lunches.  I have the day off from work so I like to come here, have some margaritas and usually the chicken mac, and read on the patio.  I'm one of the only crazy people in Arizona that still sits out on the patio in the 116 degree weather.  The staff is always very attentive and are very kind in turning on the misters just for me.  The margaritas are amazing, and the food that I've tried is also incredibly delicious.  \n\n3.5 for the food\n4 for the margaritas and atmosphere.", "useful": 2, "funny": 0, "cool": 1}
{"review_id": "3CDgIGv-TJR_3Zmgh27sqw", "user_id": "NsMBM-njwgY28ZgCUyvUoQ", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 5, "date": "2013-10-02", "text": "Best margaritas and cornbread! The diablo pasta is amazing, and you get enough for two meals. I usually do not eat leftovers, but Diablo pasta (and Alfredo in the Dark from Oreganos) is the only food I still like the second day. The cornbread, street tacos and trio salsa are fantastic. The Sixth Street frozen margarita is soo yummy and strong! Great place to start a fun evening in Scottsdale or Tempe.", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "KTsYtR3J_QYYSirVoC7JLw", "user_id": "lY20t1iun30S4UNZg31ROg", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 5, "date": "2014-05-17", "text": "Great salads and tacos. Friendly staff. Make sure to ask for cornbread it comes with dinner free, but our waitress forgot until we asked", "useful": 1, "funny": 0, "cool": 1}
{"review_id": "k8ZIB-ImYOquHCIlvORzVw", "user_id": "Rs-HbyVraRCP2X4ey1t-IQ", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 4, "date": "2008-06-10", "text": "zTejas is a good compromise for people who like quasi-authentic southwestern fare and those who don't.  Someone who doesn't want any southwestern flavor at all could go with the hamburger, chicken sandwich (hold the jalapeno mayo), or caesar salad.  I usually  have the vegetable quesadillas, chile relleno, or achiote chicken salad. Just steer clear of the Red Chile and Mango Steak Salad.   I rarely eat beef but I know what it's supposed to taste like, and this stuff was dried out and tough and gross.  I love that they offer Little Larry margaritas (smaller, cheaper, and less intoxicating than the regular size).  The food and service have been pretty consistent here and it's kinda nice not to have to deal with Fashion Square.", "useful": 3, "funny": 1, "cool": 2}
{"review_id": "4do479h0KhGAYZM62gHazQ", "user_id": "u5WPH00z4eSDl8pkww5J1Q", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 5, "date": "2014-11-17", "text": "Wanted breakfast in Tempe before a day football game. (Long lines!) we walked in just after they opened and got seated right away. When we asked about the breakfast menu we were told they were only serving lunch that day. We were clearly disappointed, but within minutes of hearing the news, a manager showed up, apologized deeply, offered us special gift certificates for our inconvenience then had the kitchen crack a couple eggs for a bacon and egg dish for my wife! I had the nachos which were a great meal size portion. And who doesn't like fresh cornbread?!? Service was on point despite the large crowd. \nI'm not normally a big fan of any 'chain' type restaurants, but when the customer service levels exceed anything I can think of, I'll be back as well as refer friends and family. Thank you Z-Tejas!", "useful": 2, "funny": 0, "cool": 2}
{"review_id": "8fI5Y3UOaxdw2nRESnXmBw", "user_id": "GNCax5LY_D8olSH-cSE_wQ", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 1, "date": "2013-12-08", "text": "What a disappointment yesterday. We wanted to have a late dinner and drinks after the football game and that wasn't possible at the Tempe z-Tejas. I love the location in Scottsdale so we thought this would be a solid spot to patronize. \n\nWe were seated in the corner like they didn't want us there. But this allowed for us to watch the timeline and activities in the area. They started filling in the tables and actually moved other patrons after they had been seated so they could accommodate another table?? Those folks were more polite, I felt this inconsiderate to their experience. On the subject of other patrons another table did better by getting their drinks from the bar. Our server was too busy standing at the server station, \"looking busy\". He wasn't, trust me, I was a server for years. Not a good habit when the computer is in guest view. \n\nThe female server in the area was on top of things and folks who were sat after us had drinks, cornbread and soup. We had asked for lemons twice to no avail, because our server never came back to our table by that time. The one thing we managed to receive was the \"hard day\" margaritas. These were over poured with alcohol and didn't taste good. \n\nIt came down to the unfortunate situation of snagging a manager from a runner. I informed him of the deplorable service and he offered to be our server. It was so long at that point I couldn't stay. It was insulting. The manager comp'd our drinks and said we were are free to go. Like we were being removed from prison. At this point I was so irritated I would have preferred a more professional phrase, such as I'm sorry for the poor service, etc. The server never introduced himself, never even looked us in the eye or took care of us and his other tables in the slightest. Here is your tip: do not work in a college town at a place where people will come late at night if you can't be polite. It's part of the job. Maybe find a job where you don't serve people because you are not good at that.", "useful": 1, "funny": 1, "cool": 1}
{"review_id": "0EER1wn445nm61GxyDHLXQ", "user_id": "gh6ZR8r00aYgrf2wKggdwQ", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 2, "date": "2017-04-25", "text": "The cornbread was good. The margarita was good. And there are your two stars. The service was pretty abysmal, and so was the rest of my food. I Ordered the chicken quesadilla, and alerted them to the fact that I have food allergies. My quesadilla came out with nothing other than chicken and cheese. It was so bland the only thing I could taste was the corn tortilla. They didn't bring me the side of rice or beans that was supposed to accompany my meal, so I can only assume that they had onions in them. They did not offer me anything else to replace them and they did not say anything or apologize. They just brought me the terrible quesadilla.", "useful": 0, "funny": 1, "cool": 0}
{"review_id": "gmi7pSGgS-jy9lea4xocCQ", "user_id": "xiI5xCJhNLXUY1_8Y-Ehew", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 4, "date": "2013-04-20", "text": "Went for Happy Hour, it was a pretty decent deal. Tostada appetizer was delish. The chambord margarita was also a a treasure.", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "F-Nu1sQ6Ho3sDFm2jhW2ow", "user_id": "8ocorqcjFoHawf2n8ywK7w", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 2, "date": "2010-12-04", "text": "I went with some trade show friends, all of us from the East coast or Midwest- hoping for some good Tex-Mex. We were all disappointed with our meals. \n\nWe started with a dip platter (guac, queso, salsa) the salsa was horrible- the guac was bland and the queso- well, you can't screw up cheese too badly...as for the entrees, I had the recommended pasta dish, and the other two had enchiladas- again, bland all the way around.\n\nOur server was very nice, but he took back 3 plates of practically untouched food and didn't offer any sort of replacement or discount (I know, we could have asked). \n\nIt's in a great neighborhood for shopping and people watching.", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "JJOJUbDK1-4RBV8IW3F5zQ", "user_id": "YyAbXfPmyjYq-zMsWmvsAg", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 4, "date": "2015-11-03", "text": "service was very quick,  had a pork pepper meal and there was enough to feed two. corn bread served with the meal. spacious and easy playing music.  Inside very cool and waitress prompt.", "useful": 0, "funny": 0, "cool": 1}
{"review_id": "q5AW0cN47GMJOmH5ENYNSw", "user_id": "XPWkDo1ufraUBvWcKRQIww", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 1, "date": "2016-11-28", "text": "Our experience was exactly the same as Patti R. except we were on our way to the evening show at Gammage on Sunday 11/27/16. We have always made dining at ZTejas a tradition before or after a show because it has always been so predictably good.\n\nWe arrived about 4:20 to an almost empty restaurant and had to wait to order, to get our drinks, to get cornbread and then finally our meals at about 5:10 from a waitress who was overwhelmed. During this time that we were waiting the entire restaurant had filled up and all of the tables around us had ordered, eaten and completed their dining experience before we even received our entrees. When we questioned the waitress she stated that she would check on our meals. This was all fine....until the manager came over. She proceeded to tell us that it was our fault that the food took so long because of the combination of items we ordered. What?? Really?? An appetizer, a salad, a burger (which was cold) and tacos? Then she said that she'd buy us a dessert but she knew that we were in a hurry and probably wouldn't want it anyway. She reluctantly took the cold burger off the check with an eye roll and the removed the happy hour appetizer for the inconvenience. We didn't need to have anything complimentary but a sincere apology from this woman who had obviously understaffed would have been sufficient. \n\nThis will be our last trip to Tempe ZTejas since there are too many other good choices for us in Tempe. It's time for a new tradition!", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "1Ozzhyo7L03wuF9zW3oSeQ", "user_id": "190zVob2rh6AN-C4w88Hbw", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 5, "date": "2017-01-18", "text": "Great Tex-Mex Food. This restaurant is always my Go Too Place for lunch and dinner with friends and client's when I am in Tempe AZ.", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "M1cLljOq3llVFaYDLH0UpQ", "user_id": "XLGgliAown151yxQxAOOWw", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 4, "date": "2011-05-03", "text": "Great food, nice atmosphere, solid service.  My only knock is it's a bit pricey in the value area.", "useful": 1, "funny": 0, "cool": 0}
{"review_id": "wgdf8xZx0Y74yaHnvNo9dA", "user_id": "ELcQDlf69kb-ihJfxZyL0A", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 2, "date": "2016-12-06", "text": "Things were not as great the 2nd time around here as we took a break from the Arts Festival for lunch. They have a lunch menu, but only three items seem to be discounted and those were smaller plates of enchilidas. The green chile beef enchilada was deemed not good and was served with poor tasting rice. The order of fajitas ($13) for me were average. Some of the achiote chicken pieces were fatty and that is unacceptable for fajitas and tortillas were luke warm.\n  The highlight of this meal was the $3 Cornbread appetizer. Real corn was involved and the hot cake melted that butter to perfection, but it could use some green chili to spice things up a bit. It's been awhile, but the HH menu offers less friendly discounts also than a few years ago.", "useful": 4, "funny": 2, "cool": 4}
{"review_id": "cyZhXCYeUBHaiI89vgpYdw", "user_id": "HhVNG_1NOEyxfxudd6TSCg", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 5, "date": "2007-02-22", "text": "i wouldn't normally give an uninspired chain restaurant a Five Star rating, but i just love their brunch specials and big patio.\n\none of my favorite weekend ventures is getting friends and cruisers together to pedal to a local patio for some eats and drinks when the weather's nice, and this place is perfect for that.\n\nit's tempe, so there's plenty of places to lock your bike within viewing distance from the joint's huge patio. it's right off mill, so there's plenty of people watching, and it seems like every other weekend there's a festival of some sort, too.\n\nthe brunch is sundays from 11 to 2, and breakfast options are as basic as eggs benedict (pretty good) to breakfast enchiladas (also spectacular). you also get muffins or cornbread to snack on that are excellent.\n\nthe best part is the drink specials, $3 mamosas and $3 bloody marys buffet. yeah, that's right, a buffet just for your perfect, do-it-yourself bloody mary. they have three or four mixes to choose from, like straight up tomato juice to their special spicy jalepeno blend. then you can add as much ice, veggies and fun stuff as you want. they have several different kinds of olives and why not throw in a beef jerky stick to stir it up? did i mention that for $3 you have your choice of top shelf vodka? i know, this is too good to be true, but it is. they have kettle one, skyy, absolut, you want it, they got it.\n\nyou're starting to understand why i would rather bike than drive up there, i hope. anyway, the crowd is so-so, but with a big group of friends, some sunshine and bicycles, it's pretty fantastic way to end a weekend.", "useful": 0, "funny": 0, "cool": 2}
{"review_id": "cT3XpPfgRGPvv3TyoiBEFg", "user_id": "uelRkS2JveGwCNExKN2xfw", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 5, "date": "2016-07-10", "text": "We came over to Z-Tejas after encountering a very unpleasant experience at another restaurant/bar.  Everyone was so inviting when we arrived and Corina was exceptional!  We frequent your location on Chandler, but will be back here often.  Thanks for still allowing us to have a Sunday Funday!", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "moGrcc1hnc80BgLjnzcsIg", "user_id": "lnERjRtMzDPRIUkaKJJACA", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 4, "date": "2010-03-14", "text": "The seafood enchiladas were great.  The complimentary cornbread is good as well.  The black beans on the side are actually beans and not a larded up mash of beans, they were very tasty. \n\nService was attentive and a good drink selection.", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "e3chj3ZRbIxLX6DQebkX3w", "user_id": "n9-XwgSU74qTFdTCN5oreQ", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 5, "date": "2010-12-24", "text": "Great food every time.  Had the season grill, and was very pleased. A lot of great flavors on that dish!", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "UeavRmkpC8lzZUEcV0xhYw", "user_id": "YbQ-htJZEiLMn6vXHXWFKA", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 4, "date": "2013-05-11", "text": "This place is great for large groups since they have an awesome happy hour!  I love the street tacos plate, chambord margarita and can't forget the cornbread YUM! A must go when I'm in town.", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "vzuwWZDqB8jg_1w6TaPq7Q", "user_id": "rRHg2CLh6YhM2jdlnw3Hyg", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 4, "date": "2012-03-10", "text": "I went there for the first time last night. I made a reservation online which was nice because you didn't have to try to call in or wait when you got there. The food is good and the service was great. They give you bread at your table which is a little different then chips from what I am use to at southwestern food but it was good. I tried the dumpling appetizer it was good!!", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "K-a640XkZBtXMHqU9A3KCw", "user_id": "Gmy3-MKNpoPmfc0wQ-TjZA", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 1, "date": "2012-02-23", "text": "This place was horrible! I will never go back it was over priced and the best thing I ate was the corn bread you get  before the meal.  I had the chorizo stuffed tenderlion it was like chewing on a piece of rubber stuffed with soy. My girl freind had  flavorless tacos with stale corn tortillas. three  words it sucked, sucked, sucked!", "useful": 1, "funny": 1, "cool": 0}
{"review_id": "WdeE-SFCKA41YDUcDqOQAg", "user_id": "HSGTDWW6d7rSf7y9NPmJog", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 4, "date": "2015-02-27", "text": "Came with a friend for happy hour and have to say I enjoyed their drinks. We had the Chambora margaritas and they were delicious with just enough of a kick. Our waitress was very friendly too.", "useful": 1, "funny": 0, "cool": 1}
{"review_id": "wtFyOZLhWNkqCCQLJx0k_w", "user_id": "yV4dun0_ALnZ6LQIsrCu_Q", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 4, "date": "2012-02-27", "text": "This is a typical Tex-Mex eatery. \n\nThe tropical guava mojitos are divine here!! The menu is fairly diverse. Mostly mexican dishes but there are salads and pastas with a spicy kick to them.\n\nThe table side guacamole is delicious but not worth the $10. (especially since it's considered an appetizer)\n\nEntrees average around $12-16. \n\nA very spacious location, so great for groups. I've heard their happy hour is great. Will try that next time. Parking is limited but there is a valet outside.", "useful": 1, "funny": 0, "cool": 2}
{"review_id": "StmPI3etloyky0bJGbp8Bw", "user_id": "Hu67zdRey2O4ctq8Sd_Yaw", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 1, "date": "2013-02-21", "text": "Heavily disappointed when me and my friends went there for lunch. I got the distinct impression the food is pre-packaged when I asked if I could order the mushroom enchiladas a la carte. The waitress said it wasn't possible and that I would have to get the full plate. I  wanted to specify, so I asked if it was impossible to just  get a couple of enchiladas....and she said it comes with rice and beans.....Arghhh! What's the deal? But the food was good and she was on top of the refills. But then dessert came around! And so she regaled me with all their desserts and they all sounded good, so I chose the berry cobbler. She said it was her favorite and I was craving some healthy additions to a possibly decadent dessert! So there we waited....30 minutes for that freakin' cobbler! And guess what? No berries!!!! It was an apple cobbler!!!! Now that I think about it, I should have talked to the manager, but after waiting so long and keeping all my friends there, I felt like I was forced to eat it. So yeah, I'm not sure I want to go back anytime soon!!!", "useful": 1, "funny": 0, "cool": 0}
{"review_id": "qcPoLmgKMCi1cp5x9rJmDA", "user_id": "7yHPMgVvG4U9QNcIq71M4Q", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 5, "date": "2014-05-12", "text": "Really enjoy food here. Severs are courteous and food is just simply awesome. Good for lunch meetings or informal gathering of friends/ family too.\n\nI am a vegetarian. I really like Z'Tejas Trio (chips + cheese +salsa and guacamole) - good for 3-4 people and for main course I like their signature pasta.\n\nIf you have never been to this place, it is a must try!\n\nEnjoy \\m/", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "sFzzFv1-MugBgJoYJ3iEdw", "user_id": "AzutF1Yp1DgoE4PJnETEOg", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 1, "date": "2017-05-06", "text": "We went here tonite to enjoy some nice Mexican food but were really disappointed. We understand it's 5 de mayo but the service sucked! You were understaffed drinks took 20 minutes! Then the food came out in sections! The longest one was an appetizer that came out after the meals! The food was cold and the server was nice enough to replace it. Server was on point with his water and was really nice I'd give him a 5 star! Wasn't his fault the food sucked! Save your money and go somewhere else food is overpriced for small bland portions!", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "b9IcnoK36U1gxVk5LpGsIw", "user_id": "wjxETVM9L2o-brlJZxPsWw", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 5, "date": "2014-03-01", "text": "After a long, tough, tiresome, frustrating day of air travel, we had a forced layover in Phoenix. The layover hotel didnt have a full service restaurant. The front desk rep recommended we go to Mill Street, which is 2 miles away and full of restaurants, shops, etc.\n\nWe wanted something not too divvy and bar like (the university is nearby, so there are many of these places), and not upscale. We decidedjjjkl to eat at Z Tejas, right off of Mill Street. Beautiful looking place, fun, inviting. Z Tejas has outdoor patio seating, complete with heat lamps. We decided to sit inside. Upon entering the crescent main doorway you encounter a huge bar, cathedral ceilings, fun music, cool mod lighting, lively, beautiful inviting mexican decor (not overly done) and plenty of seating. \n\nBartender was totally cool and friendly. I had a Chipoltle Margarita (for those of you who like it spicy. Literally! complete with a red hot pepper as the garnish.). After I drank 1/2 of it, I asked the bartender if he could 'tone it down' a bit, which he did gladly, and shook me up another full (milder) drink. Impressive.\n\nSeating was quick. Our waiter, Jay, was attentive, a bit snarky but knowledgeable and edgy. We liked him. We didn't want to order full meals, and were more interested in just drinks and a few appetizers. He recommended the Street Tacos and Chile Verde, which we now HIGHLY recommend! The food was beyond good. So flavorful, and seriously enough for 2 people to share (we started with their famous homemade cornbread, that came in a black skillet, the size of a small dessert plate. More than enough!)  GREAT place to dine!", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "EwpPV8zOtQXamg_67gsc_A", "user_id": "jOu_vAZIT8VjiIYxCwPTow", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 3, "date": "2012-11-10", "text": "Went here yesterday with a group to celebrate a going away thing...\n\nOur server was good...she got all our orders down...food came out fast...it was yummy...all went really well...\n\nexcept toward the end...after the bill was paid...some of our group left and like 5 of us were still talking...\n\nthe tab books were already picked up so thats possibly why this happened...\n\nThe manager comes up to us and asks if we mind getting up cause he's waiting to sit a table of 13 that's been waiting a while....now don't get me wrong...I would NEVER linger around if it were packed...or if there was a wait....or if it was a significant amount of time later...\n\nBut I swear we had just paid our tab maybe 15 min prior...and there were hardly any other people at the restaurant...no table around us was sat...so I am confused.\n\nHe did apologize for asking us and he said he \"waited\" as long as he could before asking us...and hey that's fine...had it made sense.  \n\nI thought maybe he said a table for 30 since that would have made some more sense...but nope it was about 10 people so I'm not sure why they needed OUR table and not...you know...the one right next to us...or the one next to that one...\n\nvery weird.\n\nbesides that it was a great time. so maybe i'll go back but I guess I'll bring a timer so that I don't overstay my welcome. lol.", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "gUgU31STeDuy3eVWFNPxEQ", "user_id": "r5I37uYTqYxYlMRpF_eKLA", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 1, "date": "2010-01-14", "text": "Seriously? This will pass for mexican food in Arizona? I have had better mexican food in Akron, OH.  Stay away from and find a street cart, seriously.  Nothing else to say but, yeck!", "useful": 0, "funny": 1, "cool": 0}
{"review_id": "ioATu-04GQ0Jync3C6_r8w", "user_id": "DfrNfJRG2dc5sBxbjAs4ug", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 5, "date": "2016-01-19", "text": "Freaking awesome!!\n\nStaff was amazing and food was wonderful. Go for the table-side Guac! Ask the wait-staff for recommendations; They've been bang on each time.", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "W6tNtY2UyarOmBJa4XkOeA", "user_id": "wwFzMOonW5OC9TVXGEkmMg", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 1, "date": "2016-07-24", "text": "Z'tejas has always been a favorite but I was sadly disappointed when coming in today to learn they had changed their queso. New queso isn't bad but the original one is definitely better and was a staple I would crave and make a trip just to get. Please bring back the original queso!!! Also, they apparently now charge for cornbread which is fine since proceeds go to a local charity but the serving staff should be much more upfront about the charge since for years and years it was free. Thankfully it's only $3 so not a big deal, plus like I said proceeds go to a local charity which is nice.\n\nIn short, Please Please Please bring back the original queso!!!!\n\nI spoke too soon. All around the food was really bad. The smoked chicken quesadilla hot the grossest synthetic smoke taste. We had to have the queso reheated because it didn't stay warm long enough to eat it. They were understaffed to service was really slow, and the catfish tacos were more like wannabe Asain infusion egg rolls. \n\nAll around bad experience and so much so that I will no longer have cravings for a once beloved eatery. Probably won't be coming back unless it's for a chambord margarita which is now the only saving grace.", "useful": 0, "funny": 1, "cool": 1}
{"review_id": "I57JHwXg07cWr6vF5pesKA", "user_id": "eqkdVuPPgojkc_HUk8cUVg", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 3, "date": "2014-07-29", "text": "Had appetizer $8 Pork Tostadas' Delicious! not much one can say about mexican fare, same 6 ingredients just arranged differently and called something else. We ate at happy hour and bloody mary's were $8.75. Went there to kill time while our flight was delayed.  Great service. Was lucky to find parking. On the sunny side of the street at 108 degrees one might argue that isn't lucky.", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "4xORn5Vv3nGD0xVSJarwjQ", "user_id": "Tj5p1TSEtoms8Qr5Yof3CA", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 4, "date": "2012-01-17", "text": "Delicious food and gracious, helpful service. Lovely place for a date or a meal with friends!", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "G3oAvf6xG-zXB9zdHj4QFg", "user_id": "mbe7yGqFKs6ySK5sGgT6fA", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 5, "date": "2013-06-10", "text": "Great margaritas!!! Two are more than enough to get very tipsy (although I am lightweight and one was enough for me). I have not been to many restaurants here where cocktails taste like cocktails and not like diluted with water syrup. \n\nFood was delicious too: not too greasy, not too spicy, and no heartburn after! Anyway, I can't wait to go back soon.", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "SSFkG0p41XDxrV0-EaLXDg", "user_id": "WjCz9whSc4mP8e5MNI8CVA", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 3, "date": "2011-05-30", "text": "Missed the happy hour but  the Margaritas were not expensive. Waited for an outside table but had to wait inside because you are not permitted to wait outside with a drink in hand. .( As an aside saw 2 arrests on Mill Ave after dinner becuse 2 guysgot caught drinking beer not so carefully disguised in brown bags.) Well worth it on a beautiful night.Great for people watching. Yes, cornbread is good but the nachos with 3 types of salsa was better. My entree was a chicken, mushroom artichoke stack. Decent but not fabulous. My wife's mushroom enchillada was better. .", "useful": 0, "funny": 1, "cool": 0}
{"review_id": "OzyvtExOdldUOn3Y-l_CHQ", "user_id": "v7SllqJPX4pVnq4EfTwl2A", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 1, "date": "2014-10-13", "text": "We checked online what time they were closed, it said 10:00pm we went at 9:15 as we are quick diners and knew we would be done quickly. We showed up at 9:15, clearly before they closed and were refused dining. We will never go back and try this restaurant because of how rude they were to us. NEVER go there because they are extremely rude and only care about getting out early and not staying open until the posted time!!!!", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "ktu07o284gsq0iqcoKh39w", "user_id": "77ztaS2A7aAhZL-Rcd8mww", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 1, "date": "2014-03-08", "text": "The food was average and the service was terrible. The app came after the entrée, really??? Was at a difference location on Wednesday and had a great time, never coming back to this location again.                 \n\nNot to mention, it was my birthday and jokingly I asked what's a good bday shot and he looked at me like I was an idiot! I went to the bathroom and my friends asked if I could get something for my birthday he replied \"Are you looking for a freebie?\" Well he obviously did not check my ID clearly since it was my birthday.\n\nWell thanks Jay that was a great birthday experience!!\n\nMate you're not much!", "useful": 0, "funny": 2, "cool": 0}
{"review_id": "qa1OiT0rzXrH5p06GWWHYg", "user_id": "lMvro2bHUT4-c5Tc9VFquQ", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 3, "date": "2016-12-10", "text": "One of my favorite places. When I am doing training in tempe I bring the new employees here for dinner and lots of drinks. Went here on a Saturday at 1:45 and all they offered was a brunch menu. Paid for our drinks and walked across the street to Whisky Row for lunch at 2:00.", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "P2q-iIIUu_h4gg4kg_dk9Q", "user_id": "lxaBfy6snoCHWtN5KPrZtw", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 4, "date": "2017-04-15", "text": "I did not have very high expectations from this place when I stopped by on a weeknight, but woohoo, it's good! Quite good. I got the fajitas (they are deliciously Whole30 compliant...to my knowledge!) and the restaurant was willing to give me extra guac to make it compliant. Service was attentive, kind, and fast. I'll definitely stop by here again!", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "QYYOAggKMHk8ZahWjIHAUQ", "user_id": "XBhTKEAtCJ_ZIkM0u6fYCQ", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 4, "date": "2015-02-26", "text": "I had the best time at this location! The atmosphere was amazing and the staff were very attentive. Thank you Luis for attending to my family with the utmost attention.  Our food was great, fast, and delicious.", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "5kOdZB-vKog36hGJDaVszA", "user_id": "5V_SYFtzQIn5ivLRFrbR6w", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 4, "date": "2012-03-29", "text": "Great outdoor patio with attentive staff. We had a few drinks and then tried the seafood enchiladas and grilled salmon. I know what you are thinking: seafood in Arizona? Still the enchiladas, though covered in a few too many layers and sauces, were tasty and the salmon was cooked perfectly.  Without knowing much about the restaurant scene here, i lucked out and would definitely go back. And when you are done just go across the street and have a cigar!!!", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "jDYpExIIL2xbrhr-cuX0BA", "user_id": "YS8cBPRlLEfYhnjvGc0LAQ", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 4, "date": "2013-08-21", "text": "Ambient is very nice, celing is high... I only ordered the tortilla soup... It was spicy for me and I did not eat it. The waitress just said since it was too spicy for you, You wont be charge for that. Thank you waitress, you made my day\nThe cornbread will not desapoint you!!!", "useful": 0, "funny": 0, "cool": 1}
{"review_id": "5rMIyTfYmmlqLswkTLCQvA", "user_id": "6s2ilc3taAWBG9YGnel9Hg", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 5, "date": "2016-03-10", "text": "I generally will order chile rellanos when I visit a Mexican restaurant for the first time.  Wow!  Was I surprised after that first taste of Tempe's Z Tejas' Smoked Chicken Chile Rellanos!  Not just a plain stuffed chile but loaded with chicken, fruit and pecans!  Certainly the most creative and tastiest dish I have ever experienced of Mexican faire!  I will definitely make another trip there just to order this outstanding meal!", "useful": 2, "funny": 0, "cool": 2}
{"review_id": "EHKsXUUPRA3tRvKMzPtL3g", "user_id": "zTK1nPD2Hpa-ksSXsE-JzQ", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 4, "date": "2013-08-09", "text": "Upon moving to AZ, we tried Z'Tejas and I was not a fan.  I can't say why exactly - the food just didn't do much for me.  \n\nI gave it another shot recently and I'm a convert!  My smoked chicken quesadilla was delish and they have a great drink menu (I had a watermelon concoction with black sea salt).  Staff was great!", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "IL_W7dJonAmSYKOCTpFbJg", "user_id": "x3gWoNBGW_KqSbNnck4OrA", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 4, "date": "2016-03-31", "text": "I'm not usually a fan of chain restaurants, but this place had great service and the food was good. We stopped in for a late evening dinner while on vacation with our two kids. I was impressed that the staff not only managed to not cringe when we walked in with two young kids, but they were really overly attentive and made sure to get their drinks and food out asap.", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "rUnm9ZZoDxAjP_lxGrEWNg", "user_id": "e3H3UBU_GbObpz2JyNeWng", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 4, "date": "2016-03-14", "text": "Such a big place for being dead on a Sunday. Good food and good service. They got rid of a bunch of stuff on the menu and even heard others complaining too that they got rid of the 3 salsa thing they used to have, they were very disappointed and also got rid of some of their tunas.", "useful": 0, "funny": 0, "cool": 1}
{"review_id": "9PPXOdsYGUyrURWseyMO_w", "user_id": "bxJfL_Vl1DxFiQSaVoqCsQ", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 4, "date": "2012-12-02", "text": "The cornbread ROCKS it every time.  It sort of reminds me of Thanksgiving corn casserole.  And it's free!\n\nI recently had the chili relleno and it was tasty but could have been heated up a bit more.", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "rbRsGiQIpMcbks_ROX2vzA", "user_id": "IotiSRv2-gBplduXdqfrcg", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 3, "date": "2007-07-23", "text": "I guess I would call this tex-mex ish.. I ordered the blackened catfish tacos.. they were excellente.. They also serve some cornbread with your meal that is wonderful.. Our waiter was super nice, and cute.. \n\nI went for lunch so it wasn't crowded at all and we didn't have to wait.", "useful": 1, "funny": 0, "cool": 2}
{"review_id": "U4INq4XzYdcJnT0SRusaXQ", "user_id": "9lipnr92ElS6EqDxLnQEiA", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 2, "date": "2014-03-17", "text": "Appetizers came with our dinner which of course shouldn't. Cornbread & catfish nuggets appetizer were really good though. After all the raving my coworkers did, I expected better", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "CS1z2TlVy3dUA9kHLL7wwg", "user_id": "FMi9EiQqcnFHwsr_GXlY_Q", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 5, "date": "2015-06-10", "text": "I have never been here before. Don't know how, z tejas has been around awhile but I came in right before happy hour ended. my server Vanessa was awesome and scored me beer right before it ended. She was really friendly and provided great service. I ordered the street tacos which were quite tasty!! Then I switched up and went to the bar to watch the rest of the finals. Both bartenders were fun and cool (didn't catch their names though) ordered a cheese cake. Smart move because it was delicious. All in all a good time.", "useful": 1, "funny": 0, "cool": 1}
{"review_id": "UQNkZMcEi7m9PaKjUPNc2Q", "user_id": "BW_qMu9KDnJoepORwljheA", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 4, "date": "2015-03-19", "text": "Been coming here for 15 years, and ZT always delivers. Stopped in last night. Super attentive bartender alerted me to happy hour specials. Pork chile verde with fresh tortillas and black beans, along with homemade cornbread and honey butter in a skillet for $8. The chile verde is real deal, the glob of cheese on top needs to go, however. Good selection of craft brews, rare for a Southwestern eatery.", "useful": 0, "funny": 0, "cool": 1}
{"review_id": "ykU0jhY2sOajy8pRHrUQGg", "user_id": "l_8nAD1xpgYZu3ILOgL5Tg", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 4, "date": "2011-01-31", "text": "We've eaten a few times and each time (knocks on wood) the service has been great and the food has been really good.  Lots of great flavor and the portions are not over the top.   Parking can be a little bit of a pain on a busy night... but... other than that... we will go back again next time we are in Tempe.  Well worth the trip.", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "f88EzFO7hOwgeZ7u430BxA", "user_id": "cMEtAiW60I5wE_vLfTxoJQ", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 4, "date": "2013-01-20", "text": "Great place to enjoy some tasty cocktails!  NIce atmosphere, friendly staff, great cocktails and good food too!", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "Qz9oWfU54qSPXEJqoUY81A", "user_id": "5K458KR8495He4msQ3Z9dA", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 2, "date": "2013-01-17", "text": "Great service by Allison; TERRIBLE food!  Took over 40 min to get awful, cold food.  Spoke to mgr, who never came to table, and only offered dessert as compensation.  \"Banana muffin\" was vanilla cream cupcake?", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "McLhJ3kLUxTrBqH2ca3i8w", "user_id": "1HM81n6n4iPIFU5d2Lokhw", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 2, "date": "2012-11-14", "text": "It's a freaking chain but they do have decent food and good margaritas.  Unlike every other location of this chain I've been to across the country this one has some stupid rule that they have a limit on the number of margaritas you can buy...   Seriously a limit of THREE?  Do I look like an 80 pound sorority girl tasting booze for the first time or I'm I still actually a 200+ pound old rugby player, honorably discharged army vet, seasoned party professional and citizen of New Orleans that finds downing three of these things easier than Cortes conquering the Aztecs?  I  lived next to the original location of this chain in Austin and I never had to contend with such a ridiculous policy.  No other place in Tempe seems to have such a stupid policy.  The margaritas are good but they are FAR from being high octane potent!   I can understand if someone is stupid drunk being cut off but just having a blanket policy that they are going to limit the number of drinks you can buy is just plain anti-capitalist and un-American!  All I can figure is they are attempting to discourage this from becoming a college hangout...  Ah well at least there are many better LOCAL joints at a better value that don't ration out their drinks in the area.", "useful": 2, "funny": 0, "cool": 0}
{"review_id": "xaF9g7CG4yzP1ZNnFT7zXg", "user_id": "sTcYq6goD1Fa2WS9MSkSvQ", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 3, "date": "2008-07-10", "text": "Z Tejas\nChain restaurant with predictable yet decent food. Here are the reasons I go there.\n\nThe best Chambord Margaritas and Peach Mojitos you will ever have! They are very overpriced but so potent you won't even feel the dent in your wallet after 2. Yea I said it - 2. They cut you off at 3 (but if you're at a table you can sneak one at the bar :)\n\nFood that keeps me coming back~\nChicken Artichoke Mushroom Stack\nMiso Salmon\nShrimp Tostada Bites\n\nHappy Hour is decent\n1/2 off Apps\n$1 off Drinks \n\nSunday's\nMake your own Bloody Mary Bar (with your preference of vodka) $3\nMimosa 3$\nHash Scramble\n\nCorn bread, corn bread, corn bread!", "useful": 5, "funny": 3, "cool": 4}
{"review_id": "-atU2NqUga67pQITxQahlQ", "user_id": "e7wlkodgykj2LHTTfV4_ow", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 3, "date": "2014-04-23", "text": "not worth the money drinks are very small with a high cost, since when do serve margarita's in a rock glass bartending 101", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "SCTyR7enI0ZeE9UJr8DfsA", "user_id": "6R0z-ck-mSt-dCep5LHlCA", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 5, "date": "2011-06-25", "text": "I have been coming here for years and have enjoyed most of my experiences, whether they are attempting to break the 3 margarita limit or seeing how many happy hour shrimp tostada bites I could shove into my slobbering maw.\n\nAll of the food is at least satisfactory with a few real winners scattered about. The achiote chicken chopped salad is a fantastic almost-healthy entree, and the chicken, artichoke and mushroom stack is a bonanza of flavor. \n\nIf you wish to have an epic gastronomic experience and care little about stomach pains and other adverse, long term affects, then I highly recommend the 5-cheese macaroni and achiote chicken. This entree is not for the faint of heart.\n\nIf you are looking for the strongest and tastiest frozen margarita, the Frusion is the way to go. The ladies might prefer the Chombord variety, but you can't go wrong with any of them.", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "n-BDNEmfXUj3WagxndfBeA", "user_id": "DmKZVlcKVhnKmXWI9Q7TNw", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 5, "date": "2009-10-31", "text": "Excellent appetizers, salads, tacos and margaritas! The frozen margaritas are VERY strong and delicious (I am not a frozen margarita fan but they came highly recommended by the waiter). Yum! But be careful--they sneak up on you. The food is fresh and consistently delicious. Reasonably priced -- more than we wanted to spend but worth every penny.", "useful": 2, "funny": 0, "cool": 0}
{"review_id": "vAxl-UboYQJYmXgFmTyMPQ", "user_id": "BQLc7jSHfPXDvleNFJ6lyg", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 3, "date": "2016-02-09", "text": "Good drink and could not eat much of the food. I have a gluten allergy and really nothing i could do. They do have a Nice happy hour. This is also a good place to people watch. Right downtown. I think on the weekend this place will be hopping. Just watch out if you have Celiec", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "LBrArLscpZDO7V_YJoZ7Rw", "user_id": "yURhWF5jdSjHCG0wb83qgg", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 3, "date": "2009-04-09", "text": "Z'Tejas is not a place I would go out of my way for in terms of the straight-up quality of the food. It's somewhere between ok and good.\nI've tried a few of the entrées but none of them really stick in the memory. The cornbread is good.\nI do end up there alot for after work margaritas and the Tejas Trio (chips with quac, salsa and queso). The chips are good.\nAlso I wish they were open later. It's hard to find a quiet place in this hood that's open late night.\nAlso, I've ended up having some pretty great conversations at this place and that must mean something... they just haven't been conversations about food.", "useful": 2, "funny": 2, "cool": 1}
{"review_id": "rlq6tZEbZdDLIOkVs88Law", "user_id": "QJI9OSEn6ujRCtrX06vs1w", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 4, "date": "2013-06-28", "text": "I came here for the first time to meet a client for lunch.  He selected this place because it was convenient for him and his office location.  Since I don't come down to Tempe very often, I didn't realize that there's free parking for this place if you dine here...so instead, I paid for metered parking down the street because it's hard to find parking in this part of Tempe during lunch.\n\nAfter reviewing the menu, we decided to split Chips & Salsa, $5 for an appetizer and I ordered a Hickory Burger, $10.75.  The Chips & Salsa was pretty good but the Burger was excellent!  Not only is it full of flavor, but it's huge and juicy....great tasting, but I shouldn't have had it for a business lunch....it could've been a disaster because it's pretty messy.  I lucked out and didn't get it on my clothes.  Next time, I will order it for dinner.\n\nService was good and the lunch was successful.  Looks like this place would be fun for happy hour...will have to give that a try sometime.\n\nReturn Factor - 90%", "useful": 6, "funny": 1, "cool": 4}
{"review_id": "hgJ0ZDYIRlEU8uKSJJna_Q", "user_id": "8QzSs8W34_PMvIuvvXxKKg", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 4, "date": "2015-01-24", "text": "5 star margaritas (even for a house recipe) and selection of homemade salsas! I might even give the ambience 5 stars but the locals probably wouldn't be as generous... being from Michigan, I was just so happy to sit outside, on a patio, in the sunshine, in the middle of January.\n\nIn total, we ordered a 2 frozen & 2 on rocks margaritas, chips & salsa and split the mushroom spinach quesadilla as our main dish. \n\nYou get a free corn bread skillet at this location.  It's a very generous portion and tasted pretty good but we took most of it as leftover. I would've preferred the chips & salsas to be complimentary regardless of how cliché that'd be.  \n\nOverall, the food was all better than I expected it to be. The ingredients seemed fresh with good color and texture at each bite. This isn't your commercial chain tex mex; it's good food and drinks full of care and hospitality from kitchen to table service.\n\nI heard they had wicked happy hour deals starting at 3 but we missed the window of time by a couple hours.", "useful": 2, "funny": 1, "cool": 2}
{"review_id": "BTPDWE45SmGEWymaktu9lg", "user_id": "6iWf71tlBSrB5QI08JgrpQ", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 2, "date": "2010-08-09", "text": "It was ok.  Place looked dirty.  Wait staff was slow to serve.  Would not return.", "useful": 1, "funny": 0, "cool": 0}
{"review_id": "eTeQTUJNEMvo_uFP-oSwmQ", "user_id": "KWV4FzEeHIrO2Dv2IDJbwA", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 3, "date": "2013-03-27", "text": "Went there for dinner a few nights ago -  The margaritas are the only factor that brought this review up to 3 stars.  Compared to a place down the street these margaritas were outstanding.\n\nThe food was nothing extraordinary.  The guacamole was WAY overpriced for what you get.  Yea, it's cool that they make it tableside but the portion is very small for $10.50 and it wasn't that flavorful.  Also, it took a significant amount of time for it to come to our table.  So much time, that our entrees were served within minutes, which is one thing I hate.  Who wants their dinner experience to be rushed?\n\nI ordered the baked seafood enchiliadas, which sounded amazing on the menu.  Very disappointing.  It definitely wasn't an enchilada...just two small tortillas stacked on top of each other with mostly a spinach filling. Not much seafood at all and they completely forgot to include any shrimp on.  When I asked for the shrimp, the waiter brought out 2 small very overcooked shrimp.  I substituted the beans for vegetables which were very bland and wilted (green beans and corn).   My boyfriend ordered the barbacoaa enchiliadas...again nothing special.  Sounded better on paper. \n\nI would maybe only go back for the happy hour margaritas.  Disappointed.", "useful": 1, "funny": 0, "cool": 0}
{"review_id": "iU2WkgV14YBI0CDWc-s5bQ", "user_id": "NK-xiNS8C5rumbdiYLDOgg", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 5, "date": "2015-03-02", "text": "There were 6 of us and we had a ball. The food was great and the margaritas super tasty. Definitely a repeat in the works.", "useful": 1, "funny": 0, "cool": 1}
{"review_id": "074iqPK0QGKyMrNm4xu9Kg", "user_id": "HxzRJbSnGIguL8-cKMyDXQ", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 5, "date": "2015-03-22", "text": "Went here for brunch with some friends, we were pleasantly surprised at the quality. The Bloody Mary bar was awesome! Food was nice and fresh, and very tasty. Would definitely come here again next time we are in Tempe.", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "07rxqg6uVwhT8HPB12_tgA", "user_id": "r9ecgI5mnHgPo4W0fPRqPA", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 5, "date": "2011-11-03", "text": "Absolutely adorable place: delicious dishes, excellent service, beautiful decor with modern art paintings and Arizona and Texas State Flags on the wall.\n\nZ'Tejas means \"the Texas\". They serve a good mix of Mexican and American food. \n\nThe presentation of the food is amazing as well. Pretty heavy though, think we over ordered, but omgosh they are all fantastic picks!", "useful": 1, "funny": 0, "cool": 0}
{"review_id": "bRmGrZpmai9bqpvgNLjYpQ", "user_id": "Z9boj3QdTXyw4glpJ84Cog", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 3, "date": "2012-09-07", "text": "Well hot damn.\n\nFood - very good.  Well, at least the stuff I got.  Catfish Tacos were great as I chowed down on them.  However, it seemed to be half-and-half as our table was split as to their meal choice.  Ohhh and while I'm on the topic, try the Steak Buritto.\n\nService - A-OK.  They were always checkign up on us.  Didn't go above or beyond but were very solid (even though they stuck us in the corner).\n\nOverall - I mean, it's a solid place for a good meal.  You're not going to get AMAZING anything, but it is a good place to head after HH.", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "r6zWduv_ZV7fp6F8OMFWmA", "user_id": "RKNV5XnPL2sSco5TmmXorQ", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 1, "date": "2014-03-10", "text": "Rude bartender, not willing to accommodate a request for tomato juice, she would have to open a large can to give a small amount, made my friend feel like very unwelcome. On our way to BLT Steak for a real dinner...", "useful": 0, "funny": 1, "cool": 0}
{"review_id": "Q1lsVQob_ekgh8QUyVmI0g", "user_id": "t4wL8Oks_8Nkt5DzWqrQFg", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 4, "date": "2014-03-29", "text": "My daughter and I were visiting ASU and tried it hoping for the best, we were not disappointed!  I had the fish tacos and she had the wild mushroom enchiladas.  We both couldn't stop praising our meals, not to mention the cornbread that was the best we ever ate.  Service was excellent and atmosphere was great. We sat outside and enjoyed the great weather.  We will definitely be going back once she starts school there in the fall.  \nThe only complaint I would have is that when I ordered Jack on the rocks, it was the smallest pour I had ever received in a bar/restaurant. (very minor, prob. not worth mentioning)", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "OBcTlUdn488qT7rR-k0QkQ", "user_id": "bQbHL3ypQ8HAx1FMlj6USg", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 4, "date": "2015-09-12", "text": "I went to Z'Tejas on a recent business trip to Phoenix.  We were looking for something a little nicer off University and Z'Tejas fit the bill perfectly.  My friend and I arrived and opted to sit at the bar.  \n\nDrinks / Appetizers:  The bartender was prompt and we were lucky enough to arrive at 6:59 and the happy hour closed at 7.  We ordered 2x of their special margaritas (the strong ones), the shrimp mini-tostadas and the tuna appetizer.  The drinks arrived promptly accompanied by the homemade cornbread (amazing) and were a fantastic mix of flavor and alcohol.  Normally with frozen margaritas they go too strong or not strong enough, these were perfect.  The sesame tuna sashimi was good as I would expect it to be, however the shrimp mini-tostadas were the star of the appetizers.  The pesto was fantastic and they went quickly.  \n\nMain Course:  We both ordered steak fajitas and they came out sizzling as they should.  I prefer a little harder char on the steak, but you couldn't deny the flavor.  They were good enough to feel confident about ordering them on a regular basis, however don't expect them to change redefine what you want in a fajita.  They were what you'd expect from a nice restaurant.    \n\nDesert:  We each started with a 3rd margarita each (which we later were told was the limit because it equates to a 1/2 bottle of alcohol) and ordered peach cobblers.  Be warned, these warm cobblers are ENORMOUS and unless you have an empty leg, or severe case of self loathing, I'd order it to share.  \n\nOverall thoughts / impression:  The restaurant was exactly what we were looking for when we walked in off University.  It was a nicer mid-tier restaurant experience in what is typically a collegey area of town (ASU is right down the street).  The Happy Hour is noteworthy in that drinks / appetizers were 1/2 off and if I make it back to Phoenix for work or fun I'd definitely attend again for that reason alone.", "useful": 1, "funny": 0, "cool": 0}
{"review_id": "b1SBwVUfFkx70c-E9a9Tcg", "user_id": "TQY03QqnBzTTALx-EI6Pmg", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 3, "date": "2008-12-29", "text": "i've sampled the z-tejas fish (and it's fabulous), the southwestern salad (and it's great), and burgers (which are finely cooked) but it's the tortilla soup that keeps me coming back for more. they will add as much avocado as you want and always give you extra cheese in the fist-fulls (when you ask for it). i should also mention that they have a great selection of flavored teas.\nmy most recent visit wasn't very positive, as it took too long to seat us (for whatever reason, they changed my party of 5 to a party of 6) i pointed this out after 20-some-odd minutes of waiting and were seated immediately.\nthe tortilla soup wasn't all that good and the service was so-so, although no one complained. i would continue to frequent this place if i lived in tempe.", "useful": 3, "funny": 2, "cool": 2}
{"review_id": "54cgPy6cegQLOY_JCyUpXA", "user_id": "KSQbXg43_R7jQ6vs3aWPnQ", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 4, "date": "2011-04-07", "text": "Jerk Chicken Salad is awesome. Margaritas on the rocks with salt, delicious. Cool space, high ceilings, good for groups, great for happy hour. Time for siesta. :)", "useful": 1, "funny": 0, "cool": 0}
{"review_id": "lvNqOjOmo8qSaSBjmtx-UA", "user_id": "AQb-lPtsUzfTvqLI1H2V7Q", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 5, "date": "2016-07-05", "text": "My family was looking for some good Mexican food in Tempe and I referred to Yelp.  We decided to to try Z Tejas. We were not disappointed.  The food was fantastic and the service was just as good.  Highly recommend this place.", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "bz8jO91lt-40pxbku5apNw", "user_id": "Ina-9Fh0bluTH34IkY6Uyw", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 4, "date": "2014-05-08", "text": "Service was good and provided wonderful recommendations. My wife and I were able to take all the time we needed to place our order then to eat. I didn't feel rushed out the door which made it a pleasant experience where we could relax have some good food and some drinks.", "useful": 2, "funny": 0, "cool": 0}
{"review_id": "FGVWKw3C14pELBiTx2MTew", "user_id": "dyhTHLIf6eWBvU78Y3T06A", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 3, "date": "2007-10-24", "text": "Z Tejas exists for one reason and one reason alone, to sell awesome margaritas at not so awesome prices that you'll totally shell out for anyway because their massive strength will sucker punch you with the first sip and then bat you around like an orca playing with a baby seal right before going in for the kill.\n\nSeriously.\n\nThree of these things will have you giggling, slurring declarations of love to the members of your party, believing your sexiness status just gained +2, craving Jack in the Box tacos and possibly breaking a heel upon your exit.\n\nThey are a thing of beauty. (And the reason why they enforce a three margarita limit.)\n\nUnfortunately, they'll run you 6 to 9 bucks depending on how much razzle dazzle you're going for. The Sixth Street Margarita is the most basic, frozen or on the rocks, and is delicious. So is the Z Top Shelf, and the Chambord, and the Frozen Watermelon, and the Grand Marnier, and I think you're sensing the trend here.\n\nAnd the food... Well, it exists so you don't leave in the condition discussed above. It's not as good as the margaritas, but once you have a couple, you're really not going to care that much.\n\nBrunch is the best time to hit this place up and indulge in a three dollar mimosa, their three dollar top shelf do-it-yourself bloody mary bar (with all the fixins, including beef jerky stir sticks!), or the epic margaritas. The chicken and potato hash is decent, but it used to be much better back when it was the savory sage chicken and potato hash and had, how do you say, actual flavor. Now it's just blah by comparison. Well done blah. But blah all the same (although Mr. Man loves it). So you may want to hit up the smothered burrito or jerk chicken salad instead, both of which are delicious. \n\nHappy hour is also a pretty good deal, with one dollar off all drinks and half price appetizers. I'd recommend the Cast Iron Skillet Dumplings that are like crispy round Asian pot stickers that come out sizzlin' in sweet chile sauce or the Tortilla Soup, which is done really, really well here with avocado and lots of chunky chicken. \n\nBut forget the food. It's the backup vocals to the wailing showboat sex symbol of a lead singer that runs back stage for a mid show sex/drug/booze binge while his second tier stand-in entertains the crowd with a limp solo. \n\nThe margaritas are bad ass and they know it. Let 'em get a little saucy with ya. \n\nOh, and the patio rocks almost as hard as the margaritas, so make sure to be seated out there.", "useful": 6, "funny": 4, "cool": 5}
{"review_id": "NSQoNvdLMUagPkHXl2rB6Q", "user_id": "aVbjPGes2isEF8W7SZoDAA", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 5, "date": "2008-10-28", "text": "It might be a chain restaurant but oh so good.   This is a place you have to check out.  I'm sorry I don't live in Tempe so I can't eat here more often.", "useful": 2, "funny": 0, "cool": 0}
{"review_id": "rjdC1QanulNlztE7j_HiWg", "user_id": "dONpnaDGfijaPfaISRrbcQ", "business_id": "Wnq5to0-jXyh0-_jRZ6VOQ", "stars": 4, "date": "2009-04-09", "text": "The place was decent. It was one of my first dinners while I was in Phoenix for business.  The cornbread is yummy and the appetizer I had with shrimp with guacomole on a chip was amazing. \n\nCan't remember what I ordered though....so that's why I'm giving it 4 stars.  It must not have been that good that I didn't crave for it enough to go back.  I was in Phoenix for 3 loooooong weeks. \n\nThey have Valet which is nice and there wasn't a long wait...is there ever in the Phoenix area?????  \n\nLeena", "useful": 3, "funny": 0, "cool": 1}
{"review_id": "71Ah3yP1alJFAafhqBMcTw", "user_id": "oOtEsKCNhMt0yF9L1Fkp9Q", "business_id": "6QIzCTSZfXL3r2mIWn58bQ", "stars": 1, "date": "2009-11-03", "text": "1st trip: Tried the appetizer sampler, which wasn't anything to write home about.  But it's OK, it was just an appetizer sampler, we weren't expecting anything spectacular.  What was really awful was the service.  As we walked in we couldn't find anyone, except someone watching TV.  So we waited there for a minute or two and finally sat ourselves.  Turns out the our waiter was the guy watching TV.  Throughout the whole evening the guy maybe visited us maybe 4 times, we couldn't even get him to take our money (still glued to the TV) so we left cash and walked out.\n\n2nd trip:  We decided to give the place a second chance because for some reason we thought the place was under new management.  Service similarly bad, waiter checked in on us more often but it still took a really long time just for the guy to run my credit card (no cash on me this time).  We had two waiters, first one messed up our orders several times on simple things like drinks--which they fixed.  The worst aspect of this evening was the food, the pizza we ordered tasted like a frozen Digiorno pizza, and not the fancy kind that taste good.  I left the restaurant convinced that the place is a cover for some sort of illicit activity.\n\nJust to make things clear: I hate giving 1 star reviews.  I'm a local and I like supporting local businesses, and there are a LOT of good restaurants in this area.  This is not one of them.  Not even remotely.", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "b3jFG08Ngh4wpt7ffDaBWg", "user_id": "L20e_VoJzUvhn2OrjBuX0w", "business_id": "6QIzCTSZfXL3r2mIWn58bQ", "stars": 2, "date": "2009-10-02", "text": "At a certain point, the bad service goes from amusing to just intolerably bad.  Taking over an hour to eat at a lunch time place is a no go.   Offering to refill two people's diet Pepsi and then switching the glasses is something we avoided on this particular trip, but has happened in the past.   Really only go here if you aren't on a schedule and don't mind fairly mediocre food.", "useful": 2, "funny": 2, "cool": 1}
{"review_id": "aXTy63OcQp3mFp-HsQrQ3g", "user_id": "keVvxZbtXrA_jf563L99QA", "business_id": "6QIzCTSZfXL3r2mIWn58bQ", "stars": 2, "date": "2008-02-04", "text": "I so desperately want to like Cafe Roma. It is a small place with a take-out area and a dining room. When you walk it, it smells incredible. I have yet to have something that tastes like the smell.\n\nI've had the Penne with meat sauce. The pasta was overcooked and the meat sauce was average. The lasagna is above average and threatens to be good, but doesn't quite make it.\n\nThe side salad is okay as far as such things go. It consists of mostly iceburg lettuce with a middle eastern type olive thrown in and a sprinkling of some kind of field green. The salad dressings I've tried are bottled.\n\nThere is a daily pasta special.", "useful": 1, "funny": 0, "cool": 0}
{"review_id": "km-MPuFDCXPeywfnoAZIEg", "user_id": "gHd4XA3WAusbC9_2USj1yA", "business_id": "6QIzCTSZfXL3r2mIWn58bQ", "stars": 4, "date": "2009-07-09", "text": "The food is always awesome! At work we routinely order 3-5 plates and we've never had a problem. Today I was inspired to yelp about Cafe Roma because I asked for eggplant instead of chicken on my chicken alfredo. Pretty much amazing. I had everyone I work with try it!\n\nThe pasta dishes are all very good, wraps are super tasty, subs are good, the calzones and strombolis are amazing, decent prices, clean and friendly atmosphere. Service has always been good for me, Ive eaten at the Cafe a 2-3 times, and I've had it delivered many times. \n\nTo wrap it up, I'd recommend eating here to anyone!", "useful": 0, "funny": 0, "cool": 0}
{"review_id": "au3CZC95JeFC4J7natZfEw", "user_id": "JNszFurQHfX_ZXx6e5eLvQ", "business_id": "6QIzCTSZfXL3r2mIWn58bQ", "stars": 2, "date": "2008-04-01", "text": "2.5 STARS would have been a perfect rating.\n\nFOOD: As far as I'm concerned, the best thing available at Cafe Roma are the calzones. The cazlones' cheese, sauce, and bread are all pretty good. They are huge and decently priced. One calzone could feed two non-starving people. I usually have to struggle to finish one. Other dishes are decent, but nothing to come back for. \n\nPRICE: A calzone and a drink cost about $9-10. \n\nATMOSPHERE: It's a typical low-cost Italian restaurant. TV's in the corners, music playing in the background, a couple decorations on the walls. Good place for lunch or modest dinner. \n\nSERVICE: Nice people, but they can be almost too helpful at times. Sometimes they come by the table four times during the meal to ask if everything is alright. Sometimes I want to shout, \"Yes! Everything is wonderful, now leave us alone!\" They know I get the calzone every time I go there, it's a cool feeling to have that regular status.\n\nSKINNY: Try the calzone, I think its pretty good. If it's not good, then I'm sorry I wasted all this time writing this review only to lead you astray.", "useful": 6, "funny": 3, "cool": 1}
{"review_id": "q3szgZyPSRz3ITnc8NAy2A", "user_id": "8959F5stCzJWI_I7dgxurg", "business_id": "6QIzCTSZfXL3r2mIWn58bQ", "stars": 3, "date": "2010-04-16", "text": "I went here for dinner a few nights ago with my wife and a friend.  It was a Wednesday night at about 8pm.  The place was dead.  All 15 or so tables were empty.  WTF.  We were there for over an hour and only like 3 people wandered in during our meal to pickup food and that was it.  I have no idea how this place stays in business.  Especially since it has been there for forever.\n\nAnyway, our waiter was very good/quick/friendly but I could tell he really didn't understand why we were there.  I'm guessing that the place is primarily a lunch place and a takeout place.  He got our orders right and my diet cokes were quickly refilled.\n\nTo start we ordered a bottle of wine.  We could tell from the waiter's reaction that this does not happen often.  All the bottles were like 20ish dollars so what the heck.\n\nHere is what we ordered:\n\n* House Salad = very good\n* Chicken Parm = good, big\n* Pizza = unexpectedly very good.  We ordered the white pizza with ricotta cheese..  I asked and our waiter said it was made fresh which was surprising.\n* Greek Salad = I didn't try this but it looked pretty good.  Not sure why but the waiter asked what kind of dressing they wanted on it.  I thought all Greek salads came with basically the same dressing.  Oh well....Italian dressing it is.\n\nI really don't want to knock a little local establishment.  The place is just ok.  Our waiter was good, the food was good, and the price was good.  It is one of the last places within walking distance of my house that I hadn't tried yet and I can now cross if off my list.  It wasn't horrible so of course I would go back but I certainly won't rush back.", "useful": 1, "funny": 0, "cool": 0}
